//=============================================================================
//
// コンボ処理 [combo.h]
// Author : 樋宮 匠
//
//=============================================================================

// 2重インクルード防止用
#ifndef _COMBO_H_
#define _COMBO_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "polygon3d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUM_SCORE_POLYGON  8   // 2Dポリゴンの数

//*****************************************************************************
// 背景クラス定義
//*****************************************************************************
class CCombo :public CPolygon3D
{
public:
	CCombo();
	~CCombo();
	HRESULT Init(void);
	void Update();
	void Draw();
	void Uninit();
	static CCombo * Create(void);
	static void AddCombo(void) { m_bCombo = true; m_nCombo += 1; }
private:
	static bool m_bCombo;
	static int  m_nCombo;
	float		m_fTex;	  // テクスチャUV座標
};
#endif