//=============================================================================
//
// エフェクト処理 [effect.h]
// Author : 樋宮 匠
//
//=============================================================================

// 2重インクルード防止用
#ifndef _EFFECT_H_
#define _EFFECT_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "polygon3d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define EFFECT_LIFE   60	// 弾の寿命

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// エフェクトクラス定義
//*****************************************************************************
class CEffect :public CPolygon3D
{
public:
	CEffect();
	~CEffect();
	HRESULT Init(D3DXVECTOR3 pos, LPDIRECT3DTEXTURE9 texture);
	void Update();
	void Draw();
	void Uninit();
	static CEffect * Create(D3DXVECTOR3 pos, LPDIRECT3DTEXTURE9 texture);
private:
	LPDIRECT3DTEXTURE9				m_pTexture;		 // テクスチャへのポインタ
	int								m_nLife;		 // 弾の寿命
	D3DXCOLOR						m_col;			 // エフェクト色
};
#endif