//=============================================================================
//
// フェード処理 [fade.h]
// Author : 樋宮 匠
//
//=============================================================================

// 二重インクルード防止用
#ifndef _FADE_H_
#define _FADE_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "manager.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define FADE_RATE 0.05f;

//*****************************************************************************
// フェードクラス定義
//*****************************************************************************
class CFade
{
public:
	// メンバ関数
	CFade();										// コンストラクタ
	~CFade();										// デストラクタ

	typedef enum
	{
		FADE_NONE = 0,
		FADE_IN,
		FADE_OUT,
	}FADE;

	HRESULT Init(void);								// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(void);								// 更新処理
	void Draw(void);								// 描画処理
	static void SetFade(CManager::MODE mode);		// フェードイン処理	
	static CFade *Create(void);		// インスタンス生成
private:
	// メンバ変数
	static D3DXCOLOR				m_col;			// 頂点カラー
	static FADE						m_fade;
	static CManager::MODE			m_modeNext;
	LPDIRECT3DVERTEXBUFFER9			m_pVtxBuff;		// 頂点バッファのポインタ
};

#endif