//=============================================================================
//
// 数字表示処理 [number.h]
// Author : 樋宮 匠
//
//=============================================================================

// 二重インクルード防止用
#ifndef _GAME_H_
#define _GAME_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "object.h"
#include "map.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// タイトルクラス定義
//*****************************************************************************
class CGame
{
public:
	// メンバ関数
	CGame();										// コンストラクタ
	~CGame();										// デストラクタ

	typedef enum
	{
		GAME_STAGE_NONE = 0,
		GAME_STAGE_TITLE,
		GAME_STAGE_01,
		GAME_STAGE_02,
		GAME_STAGE_03,
		GAME_STAGE_BOSS,
		GAME_STAGE_MAX
	}GAME_STAGE;

	HRESULT Init(GAME_STAGE stage, int score);			// 初期化処理
	void Uninit(void);									// 終了処理
	static CGame *Create(GAME_STAGE stage, int score);	// インスタンス生成
private:
	static GAME_STAGE m_stage;
};

#endif