//=============================================================================
//
// ゲーム処理 [game.cpp]
// Author : 樋宮 匠
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "game.h"
#include "map.h"
#include "magazine.h"
#include "life.h"
#include "bg.h"
#include "Score.h"

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************
CGame::GAME_STAGE CGame::m_stage = GAME_STAGE_NONE;

//=============================================================================
// コンストラクタ
//=============================================================================
CGame::CGame()
{
}

//=============================================================================
// コンストラクタ
//=============================================================================
CGame::~CGame()
{
}

//=============================================================================
// コンストラクタ
//=============================================================================
HRESULT CGame::Init(GAME_STAGE stage, int score)
{
	// 背景の生成
	//CBg::Create();
	CLife::Create();
	CMap::Create();
	CMagazine::Create();
	CScore::Create(D3DXVECTOR3(SCREEN_WIDTH / 3 * 2 + 50, 100, 0.0f), score);

	switch (stage)
	{
	case GAME_STAGE_TITLE:
		CMap::GenerateMap(CMap::MAP_TITLE);
		break;
	case GAME_STAGE_01:
		CMap::GenerateMap(CMap::MAP_01);
		break;
	case GAME_STAGE_02:
		CMap::GenerateMap(CMap::MAP_02);
		break;
	case GAME_STAGE_03:
		CMap::GenerateMap(CMap::MAP_03);
		break;
	default:
		break;
	}
	srand((unsigned int)time(NULL));

	return S_OK;
}

//=============================================================================
// コンストラクタ
//=============================================================================
void CGame::Uninit(void)
{
}

//=============================================================================
// コンストラクタ
//=============================================================================
CGame * CGame::Create(GAME_STAGE stage, int score)
{
	CGame *pGame;
	pGame = new CGame;
	pGame->Init(stage, score);
	return pGame;
}
