//=============================================================================
//
// マイク入力処理 [mic.h]
// Author : 樋宮 匠
//
//=============================================================================

// 二重インクルード防止用
#ifndef _MIC_H_
#define _MIC_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_SOUND_BUFF 2
#define SAMPLING_HZ    16000

//*****************************************************************************
// タイトルクラス定義
//*****************************************************************************
class CMic
{
public:
	// メンバ関数
	CMic();										// コンストラクタ
	~CMic();										// デストラクタ
	HRESULT Init(HWND hWnd);								// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(void);								// 更新処理
	void StartRec(void);
	void StopRec(void);
	bool IsInputSound(void);
	void SoundInputDone(void);
private:
	// メンバ変数
	HWAVEIN		 m_hwi;
	WAVEFORMATEX m_wav;
	WAVEHDR		 m_wh[MAX_SOUND_BUFF];
	bool		 m_recFlag;
};

#endif
