//=============================================================================
//
// オプション処理 [option.h]
// Author : 樋宮 匠
//
//=============================================================================

// 2重インクルード防止用
#ifndef _OPTION_H_
#define _OPTION_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "polygon3d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define DRONE_SPEED 10

//*****************************************************************************
// バレットクラス定義
//*****************************************************************************
class COption :public CPolygon3D
{
public:
	COption();
	~COption();

	HRESULT Init(void);
	void Update();
	void Draw();
	void Uninit();
	static HRESULT Load(void);
	static void Unload(void);
	static COption * Create(void);
private:
	static LPDIRECT3DTEXTURE9		m_pTexture;					 // テクスチャへのポインタ
	D3DXVECTOR3						m_pos;
	D3DXVECTOR3						m_move;						 // ポリゴンの移動量
	D3DXVECTOR3						m_rot;						 // 回転する角度
};
#endif