//=============================================================================
//
// レーザーサイト表示処理 [sight.h]
// Author : 樋宮 匠
//
//=============================================================================

// 二重インクルード防止用
#ifndef _SIGHT_H_
#define _SIGHT_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "polygon3d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SIGHT_WIDTH 4
#define SIGHT_HEIGHT 550

//*****************************************************************************
// サイトクラス定義
//*****************************************************************************
class CSight :public CPolygon3D
{
public:
	// メンバ関数
	CSight();										// コンストラクタ
	~CSight();										// デストラクタ
	HRESULT Init(void);								// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(void);								// 更新処理
	void Draw(void);								// 描画処理
	static CSight *Create(void);					// インスタンス生成
private:
	// メンバ変数
	D3DXVECTOR3						m_pos;			// ポリゴンの位置
};

#endif