//=============================================================================
//
// 武器処理 [weapon.h]
// Author : 樋宮 匠
//
//=============================================================================

// 2重インクルード防止用
#ifndef _WEAPON_H_
#define _WEAPON_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "polygon2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define BULLET_SPEED -10.0f // 弾の速さ

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// ウェポンクラス定義
//*****************************************************************************
class CWeapon
{
public:
	CWeapon();
	~CWeapon();

	// 列挙型宣言
	typedef enum
	{
		WEAPON_NONE = 0,
		WEAPON_MACHINEGUN,
		WEAPON_TRIPLE,
		WEAPON_PUNCHER,
	}WEAPON_TYPE;

	HRESULT Init(void);
	void Update();
	void Uninit();
	static void CreateShot(D3DXVECTOR3 pos);
	static void SetWeaponType(WEAPON_TYPE type) { m_type = type; }
private:
	static WEAPON_TYPE m_type;
	static bool m_bShotable;
	static int	 m_nFireRate;
};
#endif